{
    "Header.Item1": "About me",
    "Header.Item2": "Experience",
    "Header.Item3": "Projects",
    "Header.Item4": "Contact",
    "Header.cvBtn": "Resume",
    "Header.cvName": "Srinivas_Kalagotla_Resume.pdf",
    "Banner.Pretitle": "Hello! My name is",
	"Banner.Description": "A <span class='underline'>Software Engineer</span> with a real passion for developing web and mobile applications. My experience includes designing and developing backend and mobile applications, and diving into cloud solutions with <span class='underline'>AWS</span>. I have a strong foundation in <span class='underline'>Java</span>, <span class='underline'>JavaScript</span>, <span class='underline'>Python</span> and enjoy using my extensive knowledge to solve problems and build something meaningful. Currently exploring exciting opportunities to continue growing and making a positive impact with technology.",
    "Banner.ActionBtn": "Get in touch",
    "AboutMe.Title": "About me",
    "AboutMe.Paragraphs": [
    "Over the span of <span class='underline'>2+ years</span> in the software industry, I have committed myself to continuous learning and innovation. My journey began as a software engineer at <span class='underline'>Accenture</span>, where I contributed to enhancing application functionality, ensuring both quality and efficiency. In parallel, my role as a Graduate Research Assistant at the <span class='underline'>University of Missouri, Columbia</span>, allowed me to spearhead a project to provide insights into social behaviors of Autism Spectrum Disorder (ASD) individuals .",
    "While my core competencies revolve around <span class='underline'>Java</span>, <span class='underline'>Python</span>, <span class='underline'>JavaScript</span>, <span class='underline'>AWS</span>, I've had the opportunity to work with a plethora of technologies and tools, and I'm always eager to explore more."
	],
    "Experience.Title": "Experience",
    "Experience.Jobs": [
        {
            "Tab": "MU",
            "Title": "Graduate Research Assistant",
            "Date": "July 2022 - December 2023",
            "Description": [
                "Led the development of a transformative digital tool, a custom <span class='underline'>Android Wear OS</span> app, to improve healthcare diagnostics for individuals with Autism Spectrum Disorder (ASD), demonstrating a passion for creating impactful, user-centric solutions",
                "Pioneered a scalable cloud-based audio processing platform on <span class='underline'>AWS</span>, showcasing deep expertise in cloud software development and a commitment to leveraging market-leading development platforms for business solutions.",
                "Implemented a <span class='underline'>Spring Boot</span> backend for secure data management and efficient retrieval from <span class='underline'>AWS RDS</span>, highlighting proficiency in developing robust backend systems that ensure data integrity and security.",
                "Developed a real-time analytics dashboard using <span class='underline'>Angular</span>, enabling clinicians to monitor patient progress effectively, reflecting a strong foundation in front-end technologies and a dedication to delivering delightful and secure user experiences."
            ]
        },

        {
            "Tab": "Accenture",
            "Title": "Associate Software Engineer",
            "Date": "September 2020 - December 2021",
            "Description": [
                "Optimized backend performance for key applications by integrating advanced <span class='underline'>Java Spring</span> frameworks, contributing to significant improvements in application performance and user satisfaction, showcasing a talent for debugging and enhancing software through CI lifecycle management",
                "Automated discrepancy reporting in an application handling <span class='underline'>10,000+</span> invoices daily, reducing invoice errors by <span class='underline'>40%</span> and achieving significant cost savings.",
                "Significantly reduced manual workload by automating API keys synchronizations , leveraging AWS SDK for direct fetching from <span class='underline'>AWS Parameter Store</span>",
                "Resolved <span class='underline'>1000+</span> application incidents, averaging a 20-minute response time, enhancing user experience.",
                "Engaged in <span class='underline'>Agile</span> practices with daily stand-ups, focusing on progress updates and planning, contributing to enhanced team communication and efficient task management" 
            ]
        }
    ],
    "FeatureProjects.Title": "My Signature Projects",
    "FeatureProjects.Label": "Featured Project",
    "FeatureProjects.Projects": [
        {
            "Title": "Autism Spectrum Disorder (ASD) Analytics Dashboard",
			"Description": "An advanced <span class='underline'>Analytics Dashboard</span> meticulously crafted using Angular with a Flask backend. The data-driven interface retrieves insights directly from <span class='underline'>AWS RDS</span>. It showcases <span class='underline'>heart rate analysis</span>, a detailed breakdown of <span class='underline'>total spoken time</span> daily, and a comprehensive time series visualization of the data.",           
            "imgs": [
                "assets/images/dashboard/dashboard.jpg",
				"assets/images/dashboard/AD.jpg"
            ],
            "Technologies": [
                "Angular",
                "Spring Boot",
                "AWS RDS",
                "Echarts",
                "REST APIs"
            ]
        },
        {
            "Title": "Advanced Audio Recorder for Android Wearables",
            "Description": "A dedicated application for Android smartwatches designed to seamlessly record voice data. Key features include automatic transfer of recorded audio files to <span class='underline'>AWS S3</span> using <span class='underline'>AWS Amplify</span> upon stopping the recording, integrated <span class='underline'>❤</span> heart rate data capture, and smart reminders that notify users to initiate or halt recordings at preset intervals.",
            "imgs": [
                "assets/images/voiceRecorder/collage.png"
            ],
            "Technologies": [
                "Java",
                "Kotlin",
                "Android SDK",
                "AWS S3",
                "AWS Amplify"
            ]
        },        
        {
            "Title": "Architecture Design for Audio Processing",
            "Description": "A robust AWS architecture designed for audio processing. Audio files uploaded to S3 trigger a <span class='underline'>Lambda</span> via <span class='underline'>SQS</span>. The Lambda then processes the audio using <span class='underline'>AWS SageMaker</span>, storing the results back in <span class='underline'>S3 Buckets</span>. This scalable and fault-tolerant design ensures efficient handling of multiple audio files simultaneously.",
            "imgs": [
                "assets/images/aws/AWS.gif"
            ],
            "Technologies": [
                "AWS S3",
                "AWS Lambda",
                "SageMaker",
                "SQS",
                "Docker"
            ]
        }
    ],
    "OtherProjects.Title": "More personal projects",
    "OtherProjects.Projects": [
        {
            "Title": "Wellness Diagnostic Center Dashboard",
            "Description": "A comprehensive dashboard for Wellness Diagnostic Center, designed to efficiently manage and display lab test bill details. This system offers functionalities like bill addition, display within specific date ranges, and user authentication for enhanced security.",
            "ghLink": "https://github.com/SrinivasKalagotla/Wellness-Diagnoistic-Center",
            "Technologies": [
                "Angular",
                "NodeJS",
                "Express.js",
                "MongoDB"
            ]
        },        
        {
            "Title": "Voice Recorder App for Android Phones",
            "Description": "A sophisticated Android app designed for voice recording. Crafted with Java, it boasts features such as user authentication, automatic transfers to AWS S3, and an integrated media player for playback.",
            "ghLink": "https://github.com/SrinivasKalagotla/Audio-Recorder",
            "Technologies": [
                "Java",
                "AWS Amplify",
                "AWS S3",
                "Android Development"
            ]
        },
        {
            "Title": "REST API Projects",
            "Description": " A Java-based application suite featuring the Assembly AI Audio Transcription for efficient speech-to-text conversion, and the Football API - Total Goals by Team, a tool for insightful football data analysis. Both projects showcase advanced RESTful API integration, catering to needs in audio transcription and sports analytics.",
            "ghLink": "https://github.com/SrinivasKalagotla/RESTAPIs",
            "Technologies": [
                "Java",
                "GSON",
                "OOP",
                "JSON"
            ]
        },
        {
            "Title": "TIC TAC TOE Game",
            "Description": "Dive into the timeless strategy with my interactive Tic Tac Toe game, crafted with modern JavaScript. This project provides users with a seamless, nostalgic gaming experience. Leveraging sleek design and responsive features, the game is a testament to my capability in turning simple concepts into engaging digital experiences.",
            "ghLink": "https://github.com/SrinivasKalagotla/TicTacToe",
            "Technologies": [
                "JavaScript",
                "HTML",
                "CSS",
                "VS Code"
            ]
        }
    ],
    "Contact.Pretitle": "What’s Next",
    "Contact.Title": "Get in touch!",
    "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message",
    "Contact.Btn": "Say Hello"
}